
## How to read csv file

updating the file
i am modifying the notebook

In [2]:
a=10
b=30
a+b

40

In [2]:
import pandas as pd   # use for data operations
import numpy as np    # math operations
import matplotlib.pyplot as plt #diagrams\plots
import seaborn as sns           #diagrams\plots

In [3]:
# read set name: visadata set
# read csv file: comma saperated value
# extanctioin:  .csv
#

In [4]:
f_p='visa.csv'
pd.read_csv(f_p)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

**Create Dataframe Use List**

In [8]:
name=['Ramesh','suresh','satesh']
age=[30,40,50]
name,age

(['Ramesh', 'suresh', 'satesh'], [30, 40, 50])

In [7]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [8]:
pd.DataFrame(zip(name,age))

        0   1
0  Ramesh  30
1  suresh  40
2  satesh  50

In [12]:
#providing columns name
pd.DataFrame(zip(name,age),columns=cols)

    Names  AGE
0  Ramesh   30
1  suresh   40
2  satesh   50

**step-4**

In [10]:
#providing indexs
data=zip(name,age)
pd.DataFrame(data,columns=['Names','AGE'],index=['A','B','C'])

    Names  AGE
A  Ramesh   30
B  suresh   40
C  satesh   50

**step-5**

Add new columns

In [11]:
data=zip(name,age)
df=pd.DataFrame(data,columns=['Names','AGE'],index=['A','B','C'])
df

    Names  AGE
A  Ramesh   30
B  suresh   40
C  satesh   50

- if you want to add a new column

- df['new_column']

- you need to have a list which is having some elements

- That elemrnts need to equal to number 

- city_names=['Hyd','blr','chennai']

- df['city']=city_names

In [12]:
city_names=['Hyd','Blr','Chennai']

df['city']=city_names
df

    Names  AGE     city
A  Ramesh   30      Hyd
B  suresh   40      Blr
C  satesh   50  Chennai

**step-6**


$ update$ the $existing$ $columns$

- if u want to create a new column  or update the old column
- both are same

In [13]:
df['Names']=['Mani','sri kanth','kumar']
df

       Names  AGE     city
A       Mani   30      Hyd
B  sri kanth   40      Blr
C      kumar   50  Chennai

**step-7**

Drop the column

- in order to drop the column 

- we need to use drop method

- it takes 3 parameters
   - drop column  or row
   - mention the column name
   - axis
       - axis=1 reference as column
       - axis=0 reference as row
   - you want to create a new date frames or 
   - you want to overwrite the existing data frame 
       - inplace=True

In [14]:
#droping the column
df.drop('city',axis=1,inplace=True)
df

       Names  AGE
A       Mani   30
B  sri kanth   40
C      kumar   50

**step-8**

In [15]:
#drop row
df.drop('C',axis=0,inplace=True)
df

       Names  AGE
A       Mani   30
B  sri kanth   40

**step-9**


save the data frame

In [16]:
df.to_csv('output.csv')
#while saving index consider as extra column 
df.to_excel('output.xlsx')

In [17]:
pd.read_csv('output.csv')

  Unnamed: 0      Names  AGE
0          A       Mani   30
1          B  sri kanth   40

**step-10**


remove the  index

In [18]:
#to avoid the above problem
# give index=False
df.to_csv('output.csv',index=False)
df

       Names  AGE
A       Mani   30
B  sri kanth   40

In [19]:
pd.read_csv('output.csv')

       Names  AGE
0       Mani   30
1  sri kanth   40

##  Creating data frames using dictionary

**step-1**

In [73]:
d1={"NAME":['Ramesh','Suresh','Sathish'],
    "AGE":[30,35,40]}
pd.DataFrame(d1)

      NAME  AGE
0   Ramesh   30
1   Suresh   35
2  Sathish   40

- no ned to use the zip operation 
- no need to give the columns names saperately

**step-2**

- providing the index with names

In [74]:
d1={"NAME":['Ramesh','Suresh','Sathish'],
    "AGE":[30,35,40]}

df=pd.DataFrame(d1,index=['A','B','C'])
df

      NAME  AGE
A   Ramesh   30
B   Suresh   35
C  Sathish   40

**step-3**
- Adding  new column

In [75]:
city_names=['Hyd','Blr','Chennai']
df['city']=city_names
df

      NAME  AGE     city
A   Ramesh   30      Hyd
B   Suresh   35      Blr
C  Sathish   40  Chennai

**step-4**

- updating the existing columns

In [76]:
df['NAME']=['mani','mohan','anil']
df

    NAME  AGE     city
A   mani   30      Hyd
B  mohan   35      Blr
C   anil   40  Chennai

**step-5**

- dropping the row or column

In [77]:
#dropping the column
df.drop('city',axis=1,inplace=True)
df

    NAME  AGE
A   mani   30
B  mohan   35
C   anil   40

**step-6**

In [78]:
#dropping thr row
df.drop('B',axis=0,inplace=True)
df

   NAME  AGE
A  mani   30
C  anil   40

**step-7**

In [91]:
# save the data frame

df.to_csv('dictionaries.csv')

In [92]:
pd.read_csv('dictionaries.csv')

  Unnamed: 0  NAME  AGE
0          A  mani   30
1          C  anil   40

**step-8**

- removing the index

In [93]:
# to avoid the above problem
#give index=False
df.to_csv('dictionaries.csv',index=False)
pd.read_csv('dictionaries.csv')

   NAME  AGE
0  mani   30
1  anil   40

In [96]:
# In above DataFrame the index will give the default values
# we want the index names which is given by user which means 
# give the data frame name itis notting but "Df"

df

   NAME  AGE
A  mani   30
C  anil   40